### EXERCICE 1

In [6]:
import pandas as pd

rc=pd.read_csv("src/chipotle.csv")

rc

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [9]:
rc.iloc[0:11,:]
rc.head(10)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,6,3,1,Side of Chips,NaN,$1.69
7,7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [11]:
rc.shape

(4622, 6)

In [13]:
rc.iloc[0:0,:]
rc.columns

Index(['Unnamed: 0', 'order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [27]:
rc.groupby('item_name')['quantity'].sum().sort_values(ascending=False)

item_name
Chicken Bowl                             761
Chicken Burrito                          591
Chips and Guacamole                      506
Steak Burrito                            386
Canned Soft Drink                        351
Chips                                    230
Steak Bowl                               221
Bottled Water                            211
Chips and Fresh Tomato Salsa             130
Canned Soda                              126
Chicken Salad Bowl                       123
Chicken Soft Tacos                       120
Side of Chips                            110
Veggie Burrito                            97
Barbacoa Burrito                          91
Veggie Bowl                               87
Carnitas Bowl                             71
Barbacoa Bowl                             66
Carnitas Burrito                          60
Steak Soft Tacos                          56
6 Pack Soft Drink                         55
Chips and Tomatillo Red Chili Salsa       50
Chicken Crispy Tacos                      50
Chips and Tomatillo Green Chili Salsa     45
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        36
Chips and Tomatillo-Green Chili Salsa     33
Steak Salad Bowl                          31
Nantucket Nectar                          29
Chips and Tomatillo-Red Chili Salsa       25
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        23
Izze                                      20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     12
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Carnitas Crispy Tacos                      8
Veggie Soft Tacos                          8
Burrito                                    6
Veggie Salad                               6
Carnitas Salad Bowl                        6
Bowl                                       4
Steak Salad                                4
Salad                                      2
Crispy Tacos                               2
Chips and Mild Fresh Tomato Salsa          1
Carnitas Salad                             1
Veggie Crispy Tacos                        1
Name: quantity, dtype: int64

In [34]:
rc["quantity"].sum()

4972

In [ ]:
rc['item_price'] = rc['item_price'].str.replace('$','')
rc['item_price'] = rc['item_price'].astype('float')

In [49]:
(rc['item_price']*rc['quantity']).sum().round(2)

39237.02

In [ ]:
revenu=(rc['item_price']*rc['quantity'])
rc.groupby("order_id")['revenu'].sum()
rc.groupby("order_id")['revenu'].sum().mean()

### EXERCICE 2

In [102]:
house_price=pd.read_csv("house_market/house_price.csv")
house_price

    Unnamed: 0  id  house_price
0            0  14    1918154.0
1            1  30     739142.0
2            2  70    1621938.0
3            3  77    1319862.0
4            4  50     146250.0
..         ...  ..          ...
95          95  15     157223.0
96          96  81    1616313.0
97          97  42     143573.0
98          98  19     974546.0
99          99   9     157433.0

[100 rows x 3 columns]

In [103]:
chambres=pd.read_csv("house_market/nombre_de_chambres.csv")
chambres.columns=['id','chambres']
chambres

    id  chambres
0    1         4
1    2         1
2    3         4
3    4         2
4    5         4
..  ..       ...
94  95         3
95  96         2
96  97         2
97  98         2
98  99         2

[99 rows x 2 columns]

In [108]:
sdb=pd.read_csv("house_market/nombre_de_sdb.csv")
sdb.columns=['id','sdb']
sdb

    id  sdb
0    1    1
1    2    1
2    3    3
3    4    1
4    5    3
..  ..  ...
94  95    3
95  96    1
96  97    1
97  98    1
98  99    2

[99 rows x 2 columns]

In [105]:
surface=pd.read_csv("house_market/superficie.csv")
surface.columns=['id','surface']

In [ ]:
df=surface.merge(sdb,on='id').merge(chambres,on='id').merge(house_price,on='id')

In [ ]:
df.surface.mean()

SyntaxError: invalid syntax (2642985917.py, line 1)

20354.878787878788